read_verilog striping.v

proc; opt; memory; opt; fsm; opt;

techmap; opt;

dfflibmap -liberty ./cmos_cells.lib

abc -liberty ./cmos_cells.lib

clean

write_verilog striping_synth.v