read_verilog un_stripring.v

proc; opt; memory; opt; fsm; opt;

techmap; opt;

dfflibmap -liberty ./cmos_cells.lib

abc -liberty ./cmos_cells.lib

clean

write_verilog unstriping_synth.v